In [17]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [18]:
file = pd.read_csv('heights.csv')

In [19]:
file.head()

  gender     height
0   Male  73.847017
1   Male  68.781904
2   Male  74.110105
3   Male  71.730978
4   Male  69.881796

In [20]:
# Find z score of each of the entry

def find_z_score(mean, std, data):
    return (data - mean) / std

In [21]:
mean = np.mean(file['height'])
mean

66.367559754866

In [22]:
std = np.std(file['height'])
std

3.847335739579883

In [23]:
file['Z-Score'] = (file['height'] - mean) / std

In [24]:
file.head()

  gender     height   Z-Score
0   Male  73.847017  1.944061
1   Male  68.781904  0.627537
2   Male  74.110105  2.012443
3   Male  71.730978  1.394060
4   Male  69.881796  0.913421

In [25]:
(73.847017 - 66.367559754866) / 3.847335739579883

1.9440614886266032

In [28]:
file[(file['Z-Score'] <= -3) | (file["Z-Score"] >= 3)]

      gender     height   Z-Score
994     Male  78.095867  3.048423
1317    Male  78.462053  3.143602
2014    Male  78.998742  3.283099
3285    Male  78.528210  3.160798
3757    Male  78.621374  3.185013
6624  Female  54.616858 -3.054244
9285  Female  54.263133 -3.146184

In [30]:
file = file[(file['Z-Score'] > -3) & (file['Z-Score'] < 3)]

In [31]:
file

      gender     height   Z-Score
0       Male  73.847017  1.944061
1       Male  68.781904  0.627537
2       Male  74.110105  2.012443
3       Male  71.730978  1.394060
4       Male  69.881796  0.913421
...      ...        ...       ...
9995  Female  66.172652 -0.050660
9996  Female  67.067155  0.181839
9997  Female  63.867992 -0.649688
9998  Female  69.034243  0.693125
9999  Female  61.944246 -1.149708

[9993 rows x 3 columns]

In [33]:
file.drop("Z-Score", axis=1, inplace = True)

In [34]:
file

      gender     height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[9993 rows x 2 columns]